app/controllers/api/shops_controller.rb

    def show
      @shop = Shop.find(params[:id])
      if @shop
        @seller = User.find(@shop.seller_id)
---
SELECT "shops".* FROM "shops" WHERE "shops"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]