backend/app/models/user.rb

SELECT "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "Demo-user"], ["LIMIT", 1]]
---
  def self.find_by_credentials(credential, password)
    if(EmailValidator.valid?(credential))
      user = User.find_by(email: credential)
    else
      user = User.find_by(username: credential)