backend/app/controllers/api/users_controller.rb

INSERT INTO "users" ("first_name", "last_name", "email", "password_digest", "session_token", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @user = User.new({first_name: params[:first_name], email: params[:email], password: params[:password]})

    if @user.save