app/controllers/application_controller.rb

    def current_user
        @current_user ||= User.find_by(session_token: session['_trnkt_session'])
---
SELECT "users".* FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "[FILTERED]"], ["LIMIT", 1]]