app/models/user.rb

  def self.find_by_credentials(credential, password)
    user = User.find_by(email: credential)
---
SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "demo@user.io"], ["LIMIT", 1]]

  def reset_session_token!
    self.update!(session_token: generate_unique_session_token)
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "[FILTERED]"], ["updated_at", "2022-10-13 16:43:40.839649"], ["id", 1]]

  def generate_unique_session_token
    token = SecureRandom::urlsafe_base64

    while User.exists?(session_token: token)
---
SELECT 1 AS one FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "[FILTERED]"], ["LIMIT", 1]]